{
    "url": "https://www.flipkart.com/samsung-galaxy-s23-ultra-5g-phantom-black-256-gb/product-reviews/itm15952643ba06d?pid=MOBGMFFX6E6SGYWC&lid=LSTMOBGMFFX6E6SGYWCF0WEXV&marketplace=FLIPKART",
    "data": [
        {
            "rating": "5",
            "review": "Excellent product and awesome features , zoom is beyond comparisonExcellent display and good battery life. S pen is a master in it's own league.While sticking screen guards Kindly make sure glue doesn't leak to the speaker or S pen  modules as it may create an issue Inorder to avail the offerPlease go toAccountCouponsAll rewards and scroll downYou will get the offer mentioned and you can order the same if you are eligibleHappy purchasingREAD MORE"
        },
        {
            "rating": "5",
            "review": "Right now there are no other phones available in market who can complete with this one. It's a big phone with awesome display, may be the best display available even better than any iPhone. It's capable of cometiing with any entry level dslr. 10X optical zoom, 200mp primary sensor. I am not a gamer so this level of performance is completely unutilised. I bought this phone mainly because of its camera and to experience flagship phones. Looks like it's too much stuff for me, I don't even use 40...READ MORE"
        },
        {
            "rating": "5",
            "review": "I ordered the product during pre-book period, exchanging my old OP6.The product is great, the seller delivered in time. The exchange process with Flipkart was also great. After the return period I got my Galaxy buds 2 and Watch 4 classic as well.The camera quality is excellent, the battery life is great as well. I am getting around 10 hours SOT, and 24 hours total time in a full recharge.OneUI is one of the best Android experience you can get.Overall a great deal.READ MORE"
        },
        {
            "rating": "5",
            "review": "The best of the best. S23 Ultra is the best phone in the world right now.READ MORE"
        },
        {
            "rating": "4",
            "review": "Phone is just Awsome camera quality superb S Pen is addiction to ultra users And Display is quality was best...battery could be better compare to iphoneOverall Device is super fast...price is high but with offers its worth🤩🤩READ MORE"
        },
        {
            "rating": "5",
            "review": "Fantastic mobile in all means. This is the best Android in market without doubt and I feel this is far better than latest iPhone in terms of quality and features.Noted my observations after 2 weeks of usagePros1) Fantastic camera with super zoom feature which can zoom and take snaps of high quality pics located far distance. Camera performance is outstanding in low light and you can capture high quality Raw pics also2) Display (2k plus) and sound quality is superb . You cannot this much q...READ MORE"
        },
        {
            "rating": "5",
            "review": "I am thankful to almighty god to let me buy my first flagship dream device. This works like the smoothest butter I have ever seen. You throw anything on it, and it makes it work like a charm.READ MORE"
        },
        {
            "rating": "5",
            "review": "Product is really good but flipkart service is not   I am not able to get my offer which were offered with the phone kindly guide the customers in a proper way to get the buds and watch at the offer price after buying the phone.READ MORE"
        },
        {
            "rating": "5",
            "review": "One of the best camera phone 🤳 📱#samsung galaxy s23 ultra 💯 🤞READ MORE"
        },
        {
            "rating": "5",
            "review": "Wonderful , looks wise and specially feel like we have Mercedes car. Feels and touch never be explain it's feels. I hope you all understand what I mean ? in short wow 👌 wonderfulREAD MORE"
        },
        {
            "rating": "5",
            "review": "Great camera and best design.READ MORE"
        },
        {
            "rating": "5",
            "review": "Everything is good in the phone except some heating issues which also affects battery backupREAD MORE"
        },
        {
            "rating": "5",
            "review": "Extraordinary, Awesome Performance, Beaten iPhone 14 Pro Max, Samsung S23 Ultra ~ The Beast of Android Blaster 👏READ MORE"
        },
        {
            "rating": "5",
            "review": "Amazing camera and battery life.... Upgraded from Samsung note 9 to Pixel 6 pro and Finally to S23 Ultra...Extremely happy with the purchase... Night shots are really good compared to Pixels.... Battery life is mind boggling... On wifi i am getting around 7-8 hrs screen on time on heavy usage... Used Pixel 6 pro(battery life was pretty average (4-5hrs) constant heating up, could not shoot video as it shutdown due to excess heat) But this S23 ultra is crazy good... No regrets whatsoever......READ MORE"
        },
        {
            "rating": "5",
            "review": "This Smartphone is just beast 👌 I am switching to Samsung phone after long time after note 5.Design is really awesome and it's very comfortable to hold . A bit heavier side it is expected as title says beast.Display best in the market first point which interest me in this phone. Second point which I liked about of this phone is the excellent Battery life even having so huge and beautiful Display it is giving 8 -9 hrs screen on time which is again amazing. Beautiful and fluent UISo far ...READ MORE"
        },
        {
            "rating": "5",
            "review": "Product is fantastic but please guide the buyers how to claim the watch and buds offerREAD MORE"
        },
        {
            "rating": "4",
            "review": "Display very big 120Hz screen, brilliantly capable camera with 3x and 10x optical zoom, good camera faster fingerprint scanner, S Pen stylus, top performance, very long battery life upto 2 days of easy normal use . It is  huge, heavy, extremely expensive, S Pen may be superfluous feature for many.READ MORE"
        },
        {
            "rating": "1",
            "review": "Just don't buy from Flipkart because first they will not clearly mention how to  avail benefits of watch and buds and because of the i was not able to avail the offer one star is not for device it's for FlipkartREAD MORE"
        },
        {
            "rating": "5",
            "review": "Best Android phone available in market. Beautiful Display for multimedia and amazing sound system. Excellent processor for smooth daily operations and multi-tasking. No heating issues for regular usage. Not a gamer so cannot comment on gaming performance or heating issue. Amazing Battery life, can last almost 2 days for medium usage easily 1 day for even heavy usage. Finally the camera....it is going to give iphone tough competition. Awesome images and videos. Night photography is next level....READ MORE"
        },
        {
            "rating": "1",
            "review": "Terrible experience with Flipkart. They literally cheated customers. Its bundled offer for both buds and watch. But now Flipkart is saying we can only buy either of the two. This is absolutely cheating. This has to be dealt in consumer court.READ MORE"
        },
        {
            "rating": "5",
            "review": "Amazing phone amazing experience 😍READ MORE"
        },
        {
            "rating": "3",
            "review": "The product is excellent, but the Flipkart website is terrible. There is no way to get Watch 4 and Earbuds 2 at a discounted price as mentioned on the pre-booking page.Got the phone four days back, still no way to redeem goodies.READ MORE"
        },
        {
            "rating": "5",
            "review": "This is an awesome product and got it for an amazing price at flipkart great bunch of offers and exchange price on old mobile device offered by flipkartREAD MORE"
        },
        {
            "rating": "5",
            "review": "I'm in love, I'm  telling  you guys if you have the budget just go for it.READ MORE"
        },
        {
            "rating": "5",
            "review": "simplicity is the best design, simply superb in all aspects, best device i have owned so far, better in all aspects than the bitten 🍎READ MORE"
        },
        {
            "rating": "5",
            "review": "What a wonderful Android Phone, life is better after leaving iOSREAD MORE"
        },
        {
            "rating": "5",
            "review": "Awesome product good dealREAD MORE"
        },
        {
            "rating": "5",
            "review": "Fabulous 👌READ MORE"
        },
        {
            "rating": "5",
            "review": "All round the best mobileREAD MORE"
        },
        {
            "rating": "5",
            "review": "Top notch specs.Need to buy charger seperately for full support of 45W.It charges within 60 minutes most of time and screen on time is 6-7 hours.The fort is nearly 10-15 kms away from my home and zoom and clearty after taking pics it's just awesome.Had to buy this one as it gives few more features than Apple. Portraits are good too. Overall great but little pricier as we compare to US prices.READ MORE"
        },
        {
            "rating": "5",
            "review": "excellent picture clarity and nice performance tooREAD MORE"
        },
        {
            "rating": "5",
            "review": "Great 👍READ MORE"
        },
        {
            "rating": "5",
            "review": "Better then I phoneREAD MORE"
        },
        {
            "rating": "5",
            "review": "Battery-Phone will learn usage pattern so be patient and after a few days u will get superb battery life.Camera-Its is excellent as mentioned by others. If the object has details then 100x works properly else it become blurry. I recommened to use upto 80x.Size- Ya its a bulky phone coz it falls under note series.Display- its is so powerful if you look other mobiles then only u will realise and feel. My eyes never burn even after 5 hours of non stop usage.Charge Speed- Buy only origi...READ MORE"
        },
        {
            "rating": "5",
            "review": "Moved from iPhone 14 pro to ultra, what a display and camera ❤️READ MORE"
        },
        {
            "rating": "5",
            "review": "Worth every peny , the cam is next level jus like the performanceREAD MORE"
        },
        {
            "rating": "5",
            "review": "Exchanged my I phone 11 for s23 ultra......awesome phone....must have......everything is fine for this phone than an I phone...READ MORE"
        },
        {
            "rating": "5",
            "review": "The camera is awesome, battery backup will last for 2 daysREAD MORE"
        },
        {
            "rating": "3",
            "review": "The product is excellent, but the Flipkart website is terrible. There is no way to get Watch 4 and Earbuds 2 at a discounted price as mentioned on the pre-booking page.Got the phone four days back, still no way to redeem goodies.READ MORE"
        },
        {
            "rating": "5",
            "review": "Best Premium Flagship MobileREAD MORE"
        },
        {
            "rating": "5",
            "review": "Exchanged my I phone 11 for s23 ultra......awesome phone....must have......everything is fine for this phone than an I phone...READ MORE"
        },
        {
            "rating": "1",
            "review": "Prebooking offers of samsung watch 4 classic lte and buds 2 are not being enabled by Flipkart and samsung is also not bothered. Horrible experience. Samsung is making a mockery of the call when we reach them. Do not buy thisREAD MORE"
        },
        {
            "rating": "5",
            "review": "The camera is awesome, battery backup will last for 2 daysREAD MORE"
        },
        {
            "rating": "5",
            "review": "Best Premium Flagship MobileREAD MORE"
        },
        {
            "rating": "5",
            "review": "The most powerful, most capable phone in the world right now, and the best Samsung flagship since the Note 10+. Everything about this phone is great, and I have no real complaints from my 6-week usage so far.Battery life is incredible - easily lasts an entire day even on heavy usage. For the more technical users - I'm getting about 9 hours of screen-on time for 100% battery, as opposed to 6 hrs on my Note 20 Ultra.Processor and speed are amazing. Faster, stronger, and smarter than any ph...READ MORE"
        },
        {
            "rating": "4",
            "review": "Camera is awesome  performance also good but some heating  and charging  not upto the markREAD MORE"
        },
        {
            "rating": "5",
            "review": "Amazing phone which stands similar to iPhone 14 pro maxREAD MORE"
        },
        {
            "rating": "5",
            "review": "Ultimate beast device in android category 👌.READ MORE"
        },
        {
            "rating": "5",
            "review": "Only one word to say...Perfect,Perfect,Perfect...Dont go for Iphone as beast is hereREAD MORE"
        },
        {
            "rating": "5",
            "review": "Arumayana phone.... Adutha phoneREAD MORE"
        },
        {
            "rating": "5",
            "review": "This is too good. FIRSTLY THE SECURE DELIVERY BY FLIPKART. BRAND NEW SEALED PACK. THE CAMERA IS STUNNING. ZOOM QUIET GOOD. FAILS IPHONE EVEN.READ MORE"
        },
        {
            "rating": "5",
            "review": "Excellent and best camera....display is awesomeREAD MORE"
        },
        {
            "rating": "5",
            "review": "Best Android smartphone that you can buy as of today beating iPhone 15 pro maxCamera and battery life is insaneI am getting 10hrs of SOT with power saving modeYou can take DSLR level photosREAD MORE"
        },
        {
            "rating": "5",
            "review": "Never seen nike rhis camera quality 👌 Thanknu samsung s23 ultraREAD MORE"
        },
        {
            "rating": "5",
            "review": "Best android phone of 2023.Camera is best. You can pull out amazing results overall if you know to use camera with the perfect settings.Battery backup is almost 18 to 22 hours based on the network you are using and the SOT you have. I have been playing BGMI for last one month in S23 Ultra and the smoothness of this possessor is next level.QHD AMOLED display is amazing and comparable with the apple 15 display.S-pen is useful if you know how to use it.READ MORE"
        },
        {
            "rating": "5",
            "review": "Legend in the Android.....killerREAD MORE"
        },
        {
            "rating": "5",
            "review": "That Flagship Feel was Awesome 🤩Pictures captured from this mobile was stunning.The Wide angle camera performance was Too Good🤩.10x pics captures good Details 🔥It also Handles High End games - Smooth like Butter 😎READ MORE"
        },
        {
            "rating": "5",
            "review": "Product us fantastic. It's my first Samsung phone and honestly was bit skeptical before getting it. But it proved to be outstanding.  1. The ai indeed took few days getting to know my usage to provide better backup, after few days of usage I'm geeting battery around more than a day.2. No words for performance and camera. Bets in class.3. Refading watch and buds, got buds today and will get watch tomorrow. The description regarding both were unclear but after 7 days of phone delivery got th...READ MORE"
        },
        {
            "rating": "5",
            "review": "Super camera qualityREAD MORE"
        },
        {
            "rating": "5",
            "review": "I switched over to S23 Ultra and I'm loving it. I can say this is by far better than iPhone 14 pro. The boxy design gives the S23U a complete smartphone experience out of the box and you will feel it when you hold it. Ahh!! The S-pen, a cherry atop. A Suttle tweak in it's software will make samsung unbeatable. ⭐️⭐️⭐️⭐️⭐️READ MORE"
        },
        {
            "rating": "5",
            "review": "World Best Flagship Smartphone 🥰⭐⭐⭐⭐⭐From_Pravin🤴READ MORE"
        },
        {
            "rating": "5",
            "review": "Best quality zoneREAD MORE"
        },
        {
            "rating": "5",
            "review": "Best Camera setup..happy with the product 😁READ MORE"
        },
        {
            "rating": "4",
            "review": "Samsung S23 Ultra is the best mbl till date from the company. It's UI is very fast & smooth. The camera is improved from before. The heating issue is not at all felt after using the mbl. Battery is just great, having SOT around 7-8 hours with mixed usage. S Pen is another thing we would love very much which is same as S22 Ultra. Design wise no changes except for more flatter screen. Pre booked the phone on 8th February, delivered on 23rd February, so also placed the order for Samsung Galaxy ...READ MORE"
        },
        {
            "rating": "5",
            "review": "If you are looking for a true premium phone that can do it all, look no further than the Samsung S23 Ultra.It has an amazing moonshot camera that can capture stunning details of the night sky, a long-lasting battery that can last for two days with normal usage, and an outstanding display that is crisp and vibrant.The Samsung S23 Ultra is a true status symbol that shows you have taste and class, unlike the iPhone users who are part of the chapri community.READ MORE"
        },
        {
            "rating": "5",
            "review": "Considering how powerful the new Snapdragon 8 Gen 2 processor is, the Galaxy S23 Ultra is great for multitasking as well as gaming. I played Asphalt 9 on the Ultra and it ran smoothly and at no point did the phone lag However long gaming sessions heat up the phone sometimes but it also cooled down pretty quickly finally love samsung s series.READ MORE"
        },
        {
            "rating": "4",
            "review": "After one month of use I found facial recognition and fingerprint scanner are not good...being ultra top model from Samsung it should work flawlessly..night time it doesn't recognize ur face and about fingerprint scanner u have to put lots of effort to unlock ur phone by multiple time scanning ur finger by applying different amount of force on the screen.READ MORE"
        },
        {
            "rating": "5",
            "review": "My dream smartphoneCamera exellantAnd parformance is bestREAD MORE"
        },
        {
            "rating": "5",
            "review": "Goood ekdm masssst thanx flipkartREAD MORE"
        },
        {
            "rating": "5",
            "review": "Upgraded from Iphone.Best Phone. I recommend this to everyone who is using iPhones. Excellent display, stunning photos, great zoom and Best value for money phone. S pen is awesome. I am using this as a mini laptop for my work and other activities.READ MORE"
        },
        {
            "rating": "5",
            "review": "Camera quality is awesome. It do capture pic like dslr. Depth mode is also great. Battery life is a bit lower than expection from flagship phone.Performance wise i won't say best but it's above average.Fast charging is normal as compared to onePlus.READ MORE"
        },
        {
            "rating": "5",
            "review": "GoodREAD MORE"
        },
        {
            "rating": "4",
            "review": "Good product...READ MORE"
        },
        {
            "rating": "5",
            "review": "Great productREAD MORE"
        },
        {
            "rating": "5",
            "review": "Samsung do excellent jobREAD MORE"
        },
        {
            "rating": "5",
            "review": "Best from androidREAD MORE"
        },
        {
            "rating": "5",
            "review": "This is Samsung's best phone currently. The quality that Samsung S23 Ultra has is ultimate.READ MORE"
        },
        {
            "rating": "5",
            "review": "Overall phone is good, value for money, but still did not get watch and buds offer!!READ MORE"
        },
        {
            "rating": "5",
            "review": "I'm rating 5 star only because this phone is mind blowing. But I want to rate flipkart service with a negative rating because they took 12 days to deliver this phone.READ MORE"
        },
        {
            "rating": "5",
            "review": "Nice mobile, best camera, great feeling in hand , best in the market 💗READ MORE"
        },
        {
            "rating": "5",
            "review": "Awesome mobileREAD MORE"
        },
        {
            "rating": "5",
            "review": "100 times better than iphone 15 pro max or any iphone .... Definitely a product worth buying. Got this for around 85k from Flipkart during sale.The camera is amazing and video quality is also very good. Overall the phone is excellent.Only negative is size of phone is big and its not poclet friendly.READ MORE"
        },
        {
            "rating": "5",
            "review": "The king of the phones in 2023. Quite a premium product with almost perfect cameras, software etc. You can't go wrong with this phone. Impressed with its looks, audio, display, productivity and cherry on the top the S pen. It ticks all the boxes just apart from heavy gaming, which might heat the phone a bit if you using it with case. Expected charging adapter and pre installed screen protector film, but Samsung wants us to spend few( a lot) more extra bucks. Overall, a beast of phone, kind of...READ MORE"
        },
        {
            "rating": "5",
            "review": "World top quality  phone s23 love you allREAD MORE"
        },
        {
            "rating": "4",
            "review": "I purchased it 2 months back. Flip kart offered a good deal. Earlier I used apple 12 pro max. Except zoom function the camera of apple was far better. I buy samsung phones only because of s-pen. Overall a very good phone.  The design and feel of apple is more premium. Samsung need to still work on that.READ MORE"
        },
        {
            "rating": "4",
            "review": "Fab phone.  Great battery,  awesome display. Great camera. No heating issue.Splendid phoneREAD MORE"
        },
        {
            "rating": "5",
            "review": "This Phone Is Very Powerful For UseREAD MORE"
        },
        {
            "rating": "5",
            "review": "This is awesome..READ MORE"
        },
        {
            "rating": "5",
            "review": "I can only say its a father of iphone and all rest phonesREAD MORE"
        },
        {
            "rating": "5",
            "review": "Excellent phone, best at what a phone should do.The only drawback is No charger brick.READ MORE"
        },
        {
            "rating": "5",
            "review": "This is awesome..READ MORE"
        },
        {
            "rating": "5",
            "review": "I can only say its a father of iphone and all rest phonesREAD MORE"
        },
        {
            "rating": "5",
            "review": "Excellent phone, best at what a phone should do.The only drawback is No charger brick.READ MORE"
        },
        {
            "rating": "5",
            "review": "It's awesomeREAD MORE"
        },
        {
            "rating": "5",
            "review": "Awesome camaraREAD MORE"
        },
        {
            "rating": "5",
            "review": "I got this during sale. Got a good deal.Best phone for game performance and camera. The Spen works like a charm.Go for it if you want a hi end performance phone with excellent camera.READ MORE"
        },
        {
            "rating": "5",
            "review": "Outstanding mobile, was waiting since long to get one and though a little high on budget, but absolutely loving the product. I Am a Samsung mobile consumer since a decade and don't feel like changing. And the premium flagship S23 ultra has just fulfilled me to the fullest. Outstanding display, phenomenal camera, great sound clarity, s pen with more functions and a host of other features, just absolutely satisfied with the product !!!READ MORE"
        },
        {
            "rating": "5",
            "review": "If you have the budget then simply go for it over 15 plus!! You won't regret.READ MORE"
        },
        {
            "rating": "3",
            "review": "Its a perfect product only problem I have faced is that the green coating has started to wear off and its been only 1-2 months of purchase so just the quality was not up to the markREAD MORE"
        },
        {
            "rating": "5",
            "review": "Nice phone for SamsungREAD MORE"
        }
    ]
}